results/rest/stage-100/payload-heavy/800VUs/repeat-3/800vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-100/payload-heavy/800VUs/repeat-3/800vus.json)

     scenarios: (100.00%) 1 scenario, 800 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 800 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 800/800 VUs, 391 complete and 0 interrupted iterations
default   [   2% ] 800 VUs  0m01.0s/1m0s

running (0m02.0s), 800/800 VUs, 964 complete and 0 interrupted iterations
default   [   3% ] 800 VUs  0m02.0s/1m0s

running (0m03.0s), 800/800 VUs, 1525 complete and 0 interrupted iterations
default   [   5% ] 800 VUs  0m03.0s/1m0s

running (0m04.0s), 800/800 VUs, 2090 complete and 0 interrupted iterations
default   [   7% ] 800 VUs  0m04.0s/1m0s

running (0m05.0s), 800/800 VUs, 2692 complete and 0 interrupted iterations
default   [   8% ] 800 VUs  0m05.0s/1m0s

running (0m06.0s), 800/800 VUs, 3270 complete and 0 interrupted iterations
default   [  10% ] 800 VUs  0m06.0s/1m0s

running (0m07.0s), 800/800 VUs, 3854 complete and 0 interrupted iterations
default   [  12% ] 800 VUs  0m07.0s/1m0s

running (0m08.0s), 800/800 VUs, 4400 complete and 0 interrupted iterations
default   [  13% ] 800 VUs  0m08.0s/1m0s

running (0m09.0s), 800/800 VUs, 5009 complete and 0 interrupted iterations
default   [  15% ] 800 VUs  0m09.0s/1m0s

running (0m10.0s), 800/800 VUs, 5568 complete and 0 interrupted iterations
default   [  17% ] 800 VUs  0m10.0s/1m0s

running (0m11.0s), 800/800 VUs, 6145 complete and 0 interrupted iterations
default   [  18% ] 800 VUs  0m11.0s/1m0s

running (0m12.0s), 800/800 VUs, 6737 complete and 0 interrupted iterations
default   [  20% ] 800 VUs  0m12.0s/1m0s

running (0m13.0s), 800/800 VUs, 7323 complete and 0 interrupted iterations
default   [  22% ] 800 VUs  0m13.0s/1m0s

running (0m14.0s), 800/800 VUs, 7929 complete and 0 interrupted iterations
default   [  23% ] 800 VUs  0m14.0s/1m0s

running (0m15.0s), 800/800 VUs, 8519 complete and 0 interrupted iterations
default   [  25% ] 800 VUs  0m15.0s/1m0s

running (0m16.0s), 800/800 VUs, 9114 complete and 0 interrupted iterations
default   [  27% ] 800 VUs  0m16.0s/1m0s

running (0m17.0s), 800/800 VUs, 9689 complete and 0 interrupted iterations
default   [  28% ] 800 VUs  0m17.0s/1m0s

running (0m16.9s), 800/800 VUs, 10281 complete and 0 interrupted iterations
default   [  30% ] 800 VUs  0m18.0s/1m0s

running (0m17.9s), 800/800 VUs, 10855 complete and 0 interrupted iterations
default   [  32% ] 800 VUs  0m19.0s/1m0s

running (0m18.9s), 800/800 VUs, 11377 complete and 0 interrupted iterations
default   [  33% ] 800 VUs  0m20.0s/1m0s

running (0m19.9s), 800/800 VUs, 11994 complete and 0 interrupted iterations
default   [  35% ] 800 VUs  0m21.0s/1m0s

running (0m20.9s), 800/800 VUs, 12507 complete and 0 interrupted iterations
default   [  37% ] 800 VUs  0m22.0s/1m0s

running (0m21.9s), 800/800 VUs, 13164 complete and 0 interrupted iterations
default   [  38% ] 800 VUs  0m23.0s/1m0s

running (0m22.9s), 800/800 VUs, 13685 complete and 0 interrupted iterations
default   [  40% ] 800 VUs  0m24.0s/1m0s

running (0m23.9s), 800/800 VUs, 14195 complete and 0 interrupted iterations
default   [  42% ] 800 VUs  0m25.0s/1m0s

running (0m24.9s), 800/800 VUs, 14831 complete and 0 interrupted iterations
default   [  43% ] 800 VUs  0m26.0s/1m0s

running (0m25.9s), 800/800 VUs, 15414 complete and 0 interrupted iterations
default   [  45% ] 800 VUs  0m27.0s/1m0s

running (0m26.9s), 800/800 VUs, 15925 complete and 0 interrupted iterations
default   [  47% ] 800 VUs  0m28.0s/1m0s

running (0m27.9s), 800/800 VUs, 16476 complete and 0 interrupted iterations
default   [  48% ] 800 VUs  0m29.0s/1m0s

running (0m28.9s), 800/800 VUs, 17106 complete and 0 interrupted iterations
default   [  50% ] 800 VUs  0m30.0s/1m0s

running (0m29.9s), 800/800 VUs, 17675 complete and 0 interrupted iterations
default   [  52% ] 800 VUs  0m31.0s/1m0s

running (0m30.9s), 800/800 VUs, 18244 complete and 0 interrupted iterations
default   [  53% ] 800 VUs  0m32.0s/1m0s

running (0m31.9s), 800/800 VUs, 18793 complete and 0 interrupted iterations
default   [  55% ] 800 VUs  0m33.0s/1m0s

running (0m32.9s), 800/800 VUs, 19379 complete and 0 interrupted iterations
default   [  57% ] 800 VUs  0m34.0s/1m0s

running (0m33.9s), 800/800 VUs, 19947 complete and 0 interrupted iterations
default   [  58% ] 800 VUs  0m35.0s/1m0s

running (0m34.9s), 800/800 VUs, 20517 complete and 0 interrupted iterations
default   [  60% ] 800 VUs  0m36.0s/1m0s

running (0m35.9s), 800/800 VUs, 21082 complete and 0 interrupted iterations
default   [  62% ] 800 VUs  0m37.0s/1m0s

running (0m36.9s), 800/800 VUs, 21658 complete and 0 interrupted iterations
default   [  63% ] 800 VUs  0m38.0s/1m0s

running (0m37.9s), 800/800 VUs, 22218 complete and 0 interrupted iterations
default   [  65% ] 800 VUs  0m39.0s/1m0s

running (0m38.9s), 800/800 VUs, 22777 complete and 0 interrupted iterations
default   [  67% ] 800 VUs  0m40.0s/1m0s

running (0m39.9s), 800/800 VUs, 23321 complete and 0 interrupted iterations
default   [  68% ] 800 VUs  0m41.0s/1m0s

running (0m40.9s), 800/800 VUs, 23876 complete and 0 interrupted iterations
default   [  70% ] 800 VUs  0m42.0s/1m0s

running (0m41.9s), 800/800 VUs, 24389 complete and 0 interrupted iterations
default   [  72% ] 800 VUs  0m43.0s/1m0s

running (0m42.9s), 800/800 VUs, 24947 complete and 0 interrupted iterations
default   [  73% ] 800 VUs  0m44.0s/1m0s

running (0m43.9s), 800/800 VUs, 25538 complete and 0 interrupted iterations
default   [  75% ] 800 VUs  0m45.0s/1m0s

running (0m44.9s), 800/800 VUs, 26164 complete and 0 interrupted iterations
default   [  77% ] 800 VUs  0m46.0s/1m0s

running (0m45.9s), 800/800 VUs, 26776 complete and 0 interrupted iterations
default   [  78% ] 800 VUs  0m47.0s/1m0s

running (0m45.9s), 800/800 VUs, 27301 complete and 0 interrupted iterations
default   [  80% ] 800 VUs  0m48.0s/1m0s

running (0m46.9s), 800/800 VUs, 27785 complete and 0 interrupted iterations
default   [  82% ] 800 VUs  0m49.0s/1m0s

running (0m47.9s), 800/800 VUs, 28388 complete and 0 interrupted iterations
default   [  83% ] 800 VUs  0m50.0s/1m0s

running (0m48.9s), 800/800 VUs, 29027 complete and 0 interrupted iterations
default   [  85% ] 800 VUs  0m51.0s/1m0s

running (0m49.9s), 800/800 VUs, 29517 complete and 0 interrupted iterations
default   [  87% ] 800 VUs  0m52.0s/1m0s

running (0m50.9s), 800/800 VUs, 30032 complete and 0 interrupted iterations
default   [  88% ] 800 VUs  0m53.0s/1m0s

running (0m51.9s), 800/800 VUs, 30691 complete and 0 interrupted iterations
default   [  90% ] 800 VUs  0m54.0s/1m0s

running (0m52.9s), 800/800 VUs, 31239 complete and 0 interrupted iterations
default   [  92% ] 800 VUs  0m55.0s/1m0s

running (0m53.9s), 800/800 VUs, 31712 complete and 0 interrupted iterations
default   [  93% ] 800 VUs  0m56.0s/1m0s

running (0m54.9s), 800/800 VUs, 32378 complete and 0 interrupted iterations
default   [  95% ] 800 VUs  0m57.0s/1m0s

running (0m55.9s), 800/800 VUs, 32923 complete and 0 interrupted iterations
default   [  97% ] 800 VUs  0m58.0s/1m0s

running (0m56.9s), 800/800 VUs, 33407 complete and 0 interrupted iterations
default   [  98% ] 800 VUs  0m59.0s/1m0s

running (0m57.9s), 800/800 VUs, 34095 complete and 0 interrupted iterations
default   [ 100% ] 800 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 39.00% 13613 out of 34902
    benchmark_total_failure_rate...: 39.00% 13613 out of 34902

    HTTP
    http_req_duration..............: avg=1.34s min=63.12µs  med=935.8ms  max=57.98s p(90)=1.2s p(95)=1.22s
      { expected_response:true }...: avg=1.17s min=63.12µs  med=933.81ms max=57.89s p(90)=1.2s p(95)=1.22s
    http_req_failed................: 0.28%  99 out of 34902
    http_reqs......................: 34902  593.889842/s

    EXECUTION
    iteration_duration.............: avg=1.38s min=221.59ms med=958.54ms max=1m0s   p(90)=1.2s p(95)=1.22s
    iterations.....................: 34902  593.889842/s
    vus............................: 800    min=800            max=800
    vus_max........................: 800    min=800            max=800

    NETWORK
    data_received..................: 8.7 MB 148 kB/s
    data_sent......................: 1.1 GB 20 MB/s



running (0m58.8s), 000/800 VUs, 34902 complete and 0 interrupted iterations
default ✓ [ 100% ] 800 VUs  1m0s